package Day16;
/*
并发：指两个或多个事件在同一个时间段内发生。
并行：指两个或多个事件在同一时刻发生（同时发生）。

在操作系统中，安装了多个程序，并发指的是在一段时间内宏观上有多个程序同时运行，在单 CPU 系统中，
    每一时刻只能有一道程序执行，即微观上这些程序是分时的交替运行，只不过是给人的感觉是同时运行，
    那是因为分 时交替运行的时间是非常短的。
    而在多个 CPU 系统中，则这些可以并发执行的程序便可以分配到多个处理器上（CPU），实现多任务并行
    执行， 即利用每个处理器来处理一个可以并发执行的程序，这样多个程序便可以同时执行。目前电脑市
    场上说的多核 CPU，便是多核处理器，核 越多，并行处理的程序越多，能大大的提高电脑运行的效率。
注意：单核处理器的计算机肯定是不能并行的处理多个任务的，只能是多个任务在单个CPU上并发运行。同 理,
   线程也是一样的，从宏观角度上理解线程是并行运行的，但是从微观角度上分析却是串行运行的，即一个
   线程一个线程的去运行，当系统只有一个CPU时，线程会以某种顺序执行多个线程，我们把这种情况称之为
   线程调度。

进程：是指一个内存中运行的应用程序，每个进程都有一个独立的内存空间，一个应用程序可以同时运行多个
    进程；进程也是程序的一次执行过程，是系统运行程序的基本单位；系统运行一个程序即是一个进程从创
    建、运行到消亡的过程。
线程：线程是进程中的一个执行单元，负责当前进程中程序的执行，一个进程中至少有一个线程。一个进程
    中是可以有多个线程的，这个应用程序也可以称之为多线程程序。
简而言之：一个程序运行后至少有一个进程，一个进程中可以包含多个线程

线程调度:
  分时调度 所有线程轮流使用 CPU 的使用权，平均分配每个线程占用 CPU 的时间。
  抢占式调度 优先让优先级高的线程使用 CPU，如果线程的优先级相同，那么会随机选择一个(线程随机性)，
      Java使用的为 抢占式调度。
      抢占式调度详解 大部分操作系统都支持多进程并发运行，现在的操作系统几乎都支持同时运行多个程序。
          比如：现在我 们上课一边使用编辑器，一边使用录屏软件，同时还开着画图板，dos窗口等软件。
          此时，这些程序是 在同时运行，”感觉这些软件好像在同一时刻运行着“。 实际上，
          CPU(中央处理器)使用抢占式调度模式在多个线程间进行着高速的切换。对于CPU的一个核而 言，
          某个时刻，只能执行一个线程，而 CPU的在多个线程间切换速度相对我们的感觉要快，
          看上去就是 在同一时刻运行。 其实，多线程程序并不能提高程序的运行速度，但能够提高程序
          运行效率，让CPU的 使用率更高。
 */

public class DuoXianCheng {

    public static void main(String[] args) {
        /*
 Java使用 java.lang.Thread 类代表线程，所有的线程对象都必须是Thread类或其子类的实例。
     每个线程的作用是 完成一定的任务，实际上就是执行一段程序流即一段顺序执行的代码。
     Java使用线程执行体来代表这段程序流。 Java中通过继承Thread类来创建并启动多线程的步骤如下：
        1. 定义Thread类的子类，并重写该类的run()方法，该run()方法的方法体就代表了线程需要完成的
            任务,因此把 run()方法称为线程执行体。
        2. 创建Thread子类的实例，即创建了线程对象
        3. 调用线程对象的start()方法来启动该线程

         */

        MyThread mt = new MyThread("测试1");
        mt.start();
        for(int i = 0; i<=10;i++){
            System.out.println("hahahaha"+i);
        }

//        MyThread mt1 = new MyThread("测试2");
//        mt1.start();

//        for(int i = 0;i< 10;i++){
//            System.out.println("main线程："+i);
//        }
    }
}
